#!/bin/bash

ART=$'
\e[31m               \e[34m║      ║  \e[0mSCORE:  3333360  
\e[34m══════════════════╝      ╚═══════════════════════════════════════════════╗ 
      \e[31m,--.    \e[33m,---.          \e[36m,--.   \e[32m,--.                           \e[35m,--.  \e[34m║ 
     \e[31m|oo  |   \e[33m＼  `.       \e[36m| oo | \e[32m|  oo|                         \e[35m|oo  | \e[34m║ 
\e[33m o  o\e[31m|~~  |  \e[33m ／    ;       \e[36m| ~~ | \e[32m|    |\e[33mo  o  o  o  o  o  o  o  o\e[35m|    | \e[34m║ 
     \e[31m|/ / |   \e[33m`.__,／       \e[36m|/ / | \e[32m|/ / |                         \e[35m|/ / | \e[34m║
\e[34m══════════════════╗      ╔═══════════════════════════════════════════════╝
                  ║      ║  \e[0mparu -Syu 
'

# 定义更新结束后显示的消息
END="\e[33m═════════════════════════════\e[30;43m Pacman died! \e[33;49m══════════════════════════════\n"

# 使用 alacritty 启动新窗口来执行更新 
alacritty --title Pacman -e zsh -c 'echo -e "$1" && paru -Syu && echo -e "$2" && sleep 2' zsh "$ART" "$END"
